Revit 2027 API
DocumentSynchronizingWithCentralEventArgs Class
 The event arguments used by the DocumentSynchronizingWithCentralEventArgs event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentSynchronizingWithCentralEventArgs : RevitAPIPreDocEventArgs
Public Class DocumentSynchronizingWithCentralEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class DocumentSynchronizingWithCentralEventArgs : public RevitAPIPreDocEventArgs
type DocumentSynchronizingWithCentralEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The DocumentSynchronizingWithCentralEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
Comments |  User's comments for synchronization.
Document |  The document associated with the event.
(Inherited from RevitAPIPreDocEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Location |  Full path of the central model which is to be synchronized.
Options |  User's options associated with the synchronization operation.
Top
Methods
Name | Description
Cancel |  When the event is cancellable, may call the Cancel() method to cancel it.
(Inherited from RevitAPIPreEventArgs)
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace